Tekla Open API Reference for Tekla Structures 2025
FacetedBrep.CheckForTwoManifold Method
 Gets a value indicating whether this instance is 2-manifold.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CheckForTwoManifold()
Public Function CheckForTwoManifold As Boolean
Return Value
Type: Boolean
true if this instance is 2-manifold; otherwise false.
See Also
Reference
FacetedBrep Class
Tekla.Structures.Geometry3d Namespace